certainly-cyber/TI/workplace msp430/output/5529/oled_SPI_5529/oled.h
/*
 * oled.h
 *
 *  Created on: 2020年8月11日
 *      Author: certainly
 */

#ifndef OLED_H_
#define OLED_H_
//////////////////////////////////////////////////////////////////////////////////
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//中景园电子
//店铺地址：http://shop73023976.taobao.com/?spm=2013.1.0.0.M4PqC2
//
//  文 件 名   : main.c
//  版 本 号   : v2.0
//  作    者   : HuangKai
//  生成日期   : 2014-0101
//  最近修改   :
//  功能描述   : OLED 4接口演示例程(51系列)
//              说明:
//              ----------------------------------------------------------------
//              GND    电源地
//              VCC  接5V或3.3v电源
//              D0   接PA5（SCL）
//              D1   接PA7（SDA）
//              RES  接PB0
//              DC   接PB1
//              CS   接PA4
//              ----------------------------------------------------------------
// 修改历史   :
// 日    期   :
// 作    者   : HuangKai
// 修改内容   : 创建文件
//版权所有，盗版必究。
//Copyright(C) 中景园电子2014/3/16
//All rights reserved
//******************************************************************************/
//#include "sys.h"
//#include "stdlib.h"

#include "include.h"
#include <msp430.h>

//OLED模式设置
//0:4线串行模式
//1:并行8080模式
#define OLED_MODE 0
#define SIZE 16
#define XLevelL     0x00
#define XLevelH     0x10
#define Max_Column  128
#define Max_Row     64
#define Brightness  0xFF
#define X_WIDTH     128
#define Y_WIDTH     64

//-----------------测试LED端口定义----------------

/*
#define LED_ON GPIO_ResetBits(GPIOB,GPIO_Pin_8)//DC
#define LED_OFF GPIO_SetBits(GPIOB,GPIO_Pin_8)
*/


//-----------------OLED端口定义----------------



#define OLED_SCLK_Clr() P6OUT&=~BIT0//CLK-D0
#define OLED_SCLK_Set() P6OUT|=BIT0

#define OLED_SDIN_Clr() P6OUT&=~BIT1//DIN-D1
#define OLED_SDIN_Set() P6OUT|=BIT1

#define OLED_RST_Clr() P6OUT&=~BIT2//RES
#define OLED_RST_Set() P6OUT|=BIT2

#define OLED_DC_Clr() P6OUT&=~BIT3//DC
#define OLED_DC_Set() P6OUT|=BIT3

#define OLED_CS_Clr()  P6OUT&=~BIT4//CS无
#define OLED_CS_Set()  P6OUT|=BIT4





/*
#define OLED_SCLK_Clr() P8OUT&=~BIT1//CLK
#define OLED_SCLK_Set() P8OUT|=BIT1

#define OLED_SDIN_Clr() P8OUT&=~BIT2//DIN
#define OLED_SDIN_Set() P8OUT|=BIT2

#define OLED_RST_Clr() P3OUT&=~BIT0//RES
#define OLED_RST_Set() P3OUT|=BIT0

#define OLED_DC_Clr() P3OUT&=~BIT1//DC
#define OLED_DC_Set() P3OUT|=BIT1

#define OLED_CS_Clr()  P3OUT&=~BIT7//CS
#define OLED_CS_Set()  P3OUT|=BIT7
*/

/*
#define OLED_SCLK_Clr() GPIO_ResetBits(GPIOA,GPIO_Pin_5)//CLK
#define OLED_SCLK_Set() GPIO_SetBits(GPIOA,GPIO_Pin_5)

#define OLED_SDIN_Clr() GPIO_ResetBits(GPIOA,GPIO_Pin_7)//DIN
#define OLED_SDIN_Set() GPIO_SetBits(GPIOA,GPIO_Pin_7)

#define OLED_RST_Clr() GPIO_ResetBits(GPIOB,GPIO_Pin_0)//RES
#define OLED_RST_Set() GPIO_SetBits(GPIOB,GPIO_Pin_0)

#define OLED_DC_Clr() GPIO_ResetBits(GPIOB,GPIO_Pin_1)//DC
#define OLED_DC_Set() GPIO_SetBits(GPIOB,GPIO_Pin_1)

#define OLED_CS_Clr()  GPIO_ResetBits(GPIOA,GPIO_Pin_4)//CS
#define OLED_CS_Set()  GPIO_SetBits(GPIOA,GPIO_Pin_4)
*/





#define OLED_CMD  0 //写命令
#define OLED_DATA 1 //写数据


//OLED控制用函数
void OLED_WR_Byte(u8 dat,u8 cmd);
void OLED_Display_On(void);
void OLED_Display_Off(void);
void OLED_Init(void);
void OLED_Clear(void);
void OLED_DrawPoint(u8 x,u8 y,u8 t);
void OLED_Fill(u8 x1,u8 y1,u8 x2,u8 y2,u8 dot);
void OLED_ShowChar(u8 x,u8 y,u8 chr);
void OLED_ShowNum(u8 x,u8 y,u32 num,u8 len,u8 size);
void OLED_ShowString(u8 x,u8 y, u8 *p);
void OLED_Set_Pos(unsigned char x, unsigned char y);
void OLED_ShowCHinese(u8 x,u8 y,u8 no);
void OLED_DrawBMP(unsigned char x0, unsigned char y0,unsigned char x1, unsigned char y1,unsigned char BMP[]);









#endif /* OLED_H_ */
